# ViewSolarstudyCurrentStudyTypeIndex Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..ViewSolarstudyCurrentStudyTypeIndex Property
ParameterTypeId Class See Also
---
"Study type"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId ViewSolarstudyCurrentStudyTypeIndex { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property ViewSolarstudyCurrentStudyTypeIndex As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ ViewSolarstudyCurrentStudyTypeIndex {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace